Coding/Python/StatementsSyntax.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>StatementsSyntax</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="StatementsSyntax"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-02 00:33:11 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#python">主页</a><br/><a href="#disqus_thread">评论</a></div>


</head>
<body>


<div id="content">
<h1 class="title">StatementsSyntax</h1>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 对齐即为同一级</a></li>
<li><a href="#sec-2">2 tuple/lists-unpacking-assignment</a></li>
<li><a href="#sec-3">3 sequence-assignments</a></li>
<li><a href="#sec-4">4 extended-sequence-unpacking</a></li>
<li><a href="#sec-5">5 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 对齐即为同一级</h2>
<div class="outline-text-2" id="text-1">

<p>except与else对齐，是一级的。
</p>


<pre class="src src-python"><span style="color: #a020f0;">while</span> <span style="color: #a020f0;">True</span>:
    reply = <span style="color: #483d8b;">input</span>(<span style="color: #8b2252;">'Enter text: '</span>)
    <span style="color: #a020f0;">if</span> reply == <span style="color: #8b2252;">'stop'</span>:   <span style="color: #a020f0;">break</span>
    <span style="color: #a020f0;">try</span>:
        <span style="color: #483d8b;">int</span>(reply)
    <span style="color: #a020f0;">except</span>:
        <span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">'Bad '</span> * 8)
    <span style="color: #a020f0;">else</span>:
        <span style="color: #a020f0;">print</span>(<span style="color: #483d8b;">int</span>(reply) ** 2)
<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">'Bye!'</span>)
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> tuple/lists-unpacking-assignment</h2>
<div class="outline-text-2" id="text-2">




<pre class="src src-python">a, b = <span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'b'</span>
a, b = [<span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'b'</span>]
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> sequence-assignments</h2>
<div class="outline-text-2" id="text-3">




<pre class="src src-python">a, b, c, d = <span style="color: #8b2252;">'spam'</span>
</pre>

<p>
两边数目一定要相同，否则报错。
</p>


<pre class="src src-python">&gt;&gt;&gt; ((a, b), c) = (<span style="color: #8b2252;">'sp'</span>, <span style="color: #8b2252;">'am'</span>)
&gt;&gt;&gt; a, b, c
(<span style="color: #8b2252;">'s'</span>, <span style="color: #8b2252;">'p'</span>, <span style="color: #8b2252;">'am'</span>)
</pre>


<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a020f0;">for</span> (a, b, c) <span style="color: #a020f0;">in</span> [(1, 2, 3), (4, 5, 6)]:
...     <span style="color: #a020f0;">print</span>(a, b, c)
... 
1 2 3
4 5 6
&gt;&gt;&gt; <span style="color: #a020f0;">for</span> ((a, b), c) <span style="color: #a020f0;">in</span> [((1, 2), 3), ((4, 5), 6)]:
...     <span style="color: #a020f0;">print</span>(a, b, c)
... 
1 2 3
4 5 6
</pre>



<pre class="src src-python">&gt;&gt;&gt; L = [1, 2, 3, 4]
&gt;&gt;&gt; <span style="color: #a020f0;">while</span> L:
...     front, L = L[0], L[1:]
...     <span style="color: #a020f0;">print</span>(front, L)
... 
1 [2, 3, 4]
2 [3, 4]
3 [4]
4 []
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> extended-sequence-unpacking</h2>
<div class="outline-text-2" id="text-4">

<p>  *是个标识，标志着下个variable是个list，并收集所有未被赋值的所有其它变量
</p>


<pre class="src src-python">a, *b = <span style="color: #8b2252;">'spam'</span>
==&gt;a = <span style="color: #8b2252;">'s'</span>, b = [<span style="color: #8b2252;">'p'</span>, <span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'m'</span>]

&gt;&gt;&gt; a, b = <span style="color: #8b2252;">'spam'</span>
Traceback (most recent call last):
  File <span style="color: #8b2252;">"&lt;stdin&gt;"</span>, line 1, <span style="color: #a020f0;">in</span> &lt;module&gt;
<span style="color: #228b22;">ValueError</span>: too many values to unpack (expected 2)

</pre>

<p>
  *可以出现在任何地方，总是先赋完其它亦是再最后赋 *
</p>


<pre class="src src-python">&gt;&gt;&gt; x = [1, 2, 3, 4]
&gt;&gt;&gt; *a, b = x
&gt;&gt;&gt; b
4
&gt;&gt;&gt; a
[1, 2, 3]
&gt;&gt;&gt; a, *b, c = x
&gt;&gt;&gt; a
1
&gt;&gt;&gt; b
[2, 3]
&gt;&gt;&gt; c
4
</pre>

<p>
  与slicing的区别: a sequence unpacking alignment return a list for multipe matched items. while slicing returns a sequence of the same type as the object model.
</p>


<pre class="src src-python">&gt;&gt;&gt; x = <span style="color: #8b2252;">'01234'</span>
&gt;&gt;&gt; x[0], x[1:4], x[4]
(<span style="color: #8b2252;">'0'</span>, <span style="color: #8b2252;">'123'</span>, <span style="color: #8b2252;">'4'</span>)         <span style="color: #b22222;">#</span><span style="color: #b22222;">x[1:4]&#31867;&#22411;&#19982;'01234'&#30456;&#21516;</span>
&gt;&gt;&gt; a, *b, c = x
&gt;&gt;&gt; a
<span style="color: #8b2252;">'0'</span>
&gt;&gt;&gt; b                     <span style="color: #b22222;"># </span><span style="color: #b22222;">b&#20026;list&#31867;&#22411;</span>
[<span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'2'</span>, <span style="color: #8b2252;">'3'</span>]
&gt;&gt;&gt; c
<span style="color: #8b2252;">'4'</span>
</pre>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> </h2>
<div class="outline-text-2" id="text-5">


<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>

</body>
</html>
